/**百度天气类型映射码
 *  00	晴
 *  01	多云
 *  02	阴
 *  03	阵雨
 *  04	雷阵雨
 *  05	雷阵雨伴有冰雹
 *  06	雨夹雪
 *  07	小雨
 *  08	中雨
 *  09	大雨
 *  10	暴雨
 *  11	大暴雨
 *  12	特大暴雨
 *  13	阵雪
 *  14	小雪
 *  15	中雪
 *  16	大雪
 *  17	暴雪
 *  18	雾
 *  19	冻雨
 *  20	沙尘暴
 *  21	小到中雨
 *  22	中到大雨
 *  23	大到暴雨
 *  24	暴雨到大暴雨
 *  25	大暴雨到特大暴雨
 *  26	小到中雪
 *  27	中到大雪
 *  28	大到暴雪
 *  29	浮尘
 *  30	扬沙
 *  31	强沙尘暴
 *  32	浓雾
 *  33	龙卷风
 *  34	弱高吹雪
 *  35	轻雾
 *  49	强浓雾
 *  53	霾
 *  54	中度霾
 *  55	重度霾
 *  56	严重霾
 *  57	大雾
 *  58	特强浓雾
 *  301	雨
 *  302	雪
 */
export const BAIDU_WEATHER_CODE = {
  晴: '00',
  多云: '01',
  阴: '02',
  阵雨: '03',
  雷阵雨: '04',
  雷阵雨伴有冰雹: '05',
  雨夹雪: '06',
  小雨: '07',
  中雨: '08',
  大雨: '09',
  暴雨: '10',
  大暴雨: '11',
  特大暴雨: '12',
  阵雪: '13',
  小雪: '14',
  中雪: '15',
  大雪: '16',
  暴雪: '17',
  雾: '18',
  冻雨: '19',
  沙尘暴: '20',
  小到中雨: '21',
  中到大雨: '22',
  大到暴雨: '23',
  暴雨到大暴雨: '24',
  大暴雨到特大暴雨: '25',
  小到中雪: '26',
  中到大雪: '27',
  大到暴雪: '28',
  浮尘: '29',
  扬沙: '30',
  强沙尘暴: '31',
  浓雾: '32',
  龙卷风: '33',
  弱高吹雪: '34',
  轻雾: '35',
  强浓雾: '49',
  霾: '53',
  中度霾: '54',
  重度霾: '55',
  严重霾: '56',
  大雾: '57',
  特强浓雾: '58',
  雨: '301',
  雪: '302',
}
